config/cf/Enums/ВидыСтандартногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыСтандартногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВариантыСтандартногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыСтандартногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сегодня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завтра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлаяНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последние7Дней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтойНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтаНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтойНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Следующие7Дней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующаяНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлаяДекада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтойДекады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтаДекада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтойДекады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующаяДекада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлыйМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтогоМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтотМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтогоМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующийМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлыйКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтогоКвартала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтотКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтогоКвартала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующийКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлоеПолугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтогоПолугодия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоПолугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтогоПолугодия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующееПолугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрошлыйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНачалаЭтогоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтотГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКонцаЭтогоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующийГод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/CommonForms/ФормаВыбраВариантаСтандартногоПериода/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантСтандартногоПериода", ВариантСтандартногоПериода) 
		И Параметры.Свойство("ВидСтандартногоПериода", ВидСтандартногоПериода) Тогда
		ОбновитьСписокПериодов();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ВидСтандартногоПериода) Тогда
		ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц");
		ОбновитьСписокПериодов();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВариантовПериодаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОбразецПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбразецПериода()
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначениеТекущегоПериода = ТекущиеДанные.Значение;
	мСтандарнтыйПериод 		= Новый СтандартныйПериод(МетрикиКлиентСервер.ВариантСтандартногоПериода(ЗначениеТекущегоПериода));
	ДатаНачала 				= мСтандарнтыйПериод.ДатаНачала;
	ДатаОкончания 			= мСтандарнтыйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Функция ТекущаяДатаСеансаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДень(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Сегодня");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеделя(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаНеделя");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДекада(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаДекада");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМесяц(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотМесяц");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКвартал(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотКвартал");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолугодие(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Полугодие");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтоПолугодие");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГод(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотГод");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПериодов()
	
	СписокПериодов.Очистить();
	СписокПериодов	= МетрикиКлиентСервер.СписокВычисляемыхПериодов(ВидСтандартногоПериода);
	
	Если ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.Сегодня).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтаНеделя).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтаДекада).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотМесяц).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотКвартал).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Полугодие") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтоПолугодие).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотГод).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("ВариантСтандартногоПериода", ТекущиеДанные.Значение);	
	РезультатСтруктура.Вставить("ВидСтандартногоПериода",	  ВидСтандартногоПериода);	
	ЭтаФорма.Закрыть(РезультатСтруктура);		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовПериодаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьПериод(Неопределено);
	
КонецПроцедуры

#КонецОбласти
